/* Διαβάστε τον κώδικα, προσπαθήστε να καταλάβετε τι κάνει από μόνοι σας (σκοπίμως δεν έχουν μπει σχόλια που να εξηγούν
  τι κάνουν οι διάφορες εντολές) και μετά γράψτε μόνοι σας το υπόλοιπο πρόγραμμα με τις οδηγίες που θα βρείτε στα σχόλια.
  Χρησιμοποιήστε της μεταβλητές αληθείας (boolean) ώστε οι εντολές της κάθε κατάστασης (state) να εκτελούνται μόνο μια φορά.
  Ο σκοπός σας είναι, να τελειώσετε το πρόγραμμα στο σπίτι και όταν το δοκιμάσετε στο αμαξάκι, το αμαξάκι να επιδείξει
  την εξής συμπεριφορά:
  Θα προχωρήσει περίπου 20 εκατοστά και θα στρίψει 180 μοίρες (αυτό είναι ήδη έτοιμο για εσάς).
  Θα προχωρήσει ΕΠΙΠΛΕΟΝ περίπου 60 εκατοστά (δηλαδή πόσα απ' την αρχή της λειτουργίας του;) και θα στρίψει 90 μοίρες προς
  τα αριστερά.
  Τέλος, θα συνεχίσει να κινείται ευθεία, μέχρι να διανύσει συνολικά (από την αρχή δηλαδή της λειτουργίας του) 150 εκατοστά. */

#include <Smartcar.h>

Odometer encoderLeft(180), encoderRight(180); //Βάλτε τους δικούς σας παλμούς ανά μέτρο
Gyroscope gyro(13); //Βάλτε την κατάλληλη τιμή σύμφωνα με το γυροσκόπιό σας
Car folkracer;
boolean state1Done = false;
boolean state2Done = false;

void setup() {
  gyro.attach();
  encoderLeft.attach(3); //Χρησιμοποιήστε τα σωστά pins!
  encoderRight.attach(2);
  encoderLeft.begin();
  encoderRight.begin();
  gyro.begin();
  folkracer.begin(encoderLeft, encoderRight, gyro);
  folkracer.enableCruiseControl();//Ενεργοποιούμε τον "ελεγκτή" της ταχύτητας
  folkracer.setSpeed(0.5);
}

void loop() {
  folkracer.updateMotors();
  unsigned long distance = encoderLeft.getDistance();//Αποθηκεύουμε στην μεταβλητή distance την τιμή που έχουμε πάρει από το αριστερό encoder
  distance = distance + encoderRight.getDistance();//Στην ίδια μεταβλητή distance αποθηκεύουμε την τιμή της συν την τιμή που μας δίνει το δεξί encoder
  if (distance > 20) {//Αν η τιμή distance είναι μεγαλύτερη από 20,
    if (distance < 30) {//Μικρότερη από 30,
      if (state1Done == false) {//Και η πρώτη κατάσταση του αυτοκινήτου δεν έχει ολοκληρωθεί,
        folkracer.stop();//Το αυτοκίνητο να σταματήσει,
        folkracer.rotate(180);//Να γυρίσει 180 μοίρες,
        folkracer.setSpeed(0.5);//Και να αυξήση της ταχύτητά του σε 0.5
        state1Done = true;//Τότε, η πρώτη κατάσταση, ας σημανθεί ως ολοκληρωμένη
      }
    }
  }
  if (distance > 80) { //Όταν το αυτοκινητάκι έχει διανύσει από 80
    if (distance < 90) { //μέχρι 90 εκατοστά,
      if (state2Done == false){//Αν η δεύτερη κατάσταση δεν έχει ολοκληρωθεί
        folkracer.stop();//τότε σταματήστε το
        folkracer.rotate(90);//και μετά περιστρέψτε το κατά 90 μοίρες στα δεξιά.
        folkracer.setSpeed(0.5);// Στη συνέχεια, θέστε ταχύτητα 0.5 μέτρα το δευτερόλεπτο
        state2Done=true;
      }
    }
  }
  if (distance > 150) { //Όταν το αυτοκινητάκι έχει διανύσει απόσταση μεγαλύτερη των 150 εκατοστών,
    folkracer.stop(); //τότε πείτε του να σταματήσει (ή εναλλακτικά θέστε ταχύτητα μηδέν)
  }
}
